Revit 2026 API

# ConnectorAssignedKCoefficient Property

---

The assigned kCoefficient of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AssignedKCoefficient { get; set; }
```
```vb
Public Property AssignedKCoefficient As Double
	Get
	Set
```
```cpp
public:
property double AssignedKCoefficient {
	double get ();
	void set (double value);
}
```
```fsharp
member AssignedKCoefficient : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not DomainPiping. Thrown when the connector is not in a family instance. |
| ArgumentException | Thrown when set an invalid value. |
| InvalidOperationException | Thrown on failure to get or set kCoefficient. |

Assigned kCoefficient may be assigned for connectors of some family instances, for more information. In order to set this property, it must be mapped to a writable instance parameter in the family definition.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace